Autodesk.Revit.DB.Structure.ReinforcementUtils.Is3DReinforcement(Autodesk.Revit.DB.Element,System.Int32,System.Boolean)
Returns true if the reinforcement is 3D.
reinforcementElement:
The reinforcement element. Should be Rebar or RebarInSystem.
barPosition:
A bar position index between 0 and NumberOfBarPositions-1.
considerMultiplanarBarsAs3D:
If true multiplanar bars will be considered as 3D bars.
Returns:
True if the shape of the reinforcement is 3D, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
reinforcementElement is not a Rebar or a RebarInSystem.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
barPosition is not in the range [ 0, NumberOfBarPositions-1 ].

Autodesk.Revit.DB.Structure.ReinforcementUtils.FormatUnits(Autodesk.Revit.DB.Units,Autodesk.Revit.DB.ForgeTypeId,System.Double,System.Boolean,System.Boolean)
Formats a number with units into a string.
units:
The units formatting settings, typically obtained from Document.GetUnits().
specTypeId:
Identifier of the spec of the value to format.
value:
The value to format, in Revit's internal units.
maxAccuracy:
True if the value should be rounded to an increased accuracy level appropriate for editing or understanding the precise value stored in the model.  False if the accuracy specified by the FormatOptions should be used, appropriate for printed drawings.
forEditing:
True if the formatting should be modified as necessary so that the formatted string can be successfully parsed, for example by suppressing digit grouping.  False if unmodified settings should be used, suitable for display only.
Returns:
The formatted string.
Throws Autodesk.Revit.Exceptions.ArgumentException:
specTypeId is not a measurable spec identifier. See UnitUtils.IsMeasurableSpec(ForgeTypeId).
-or-
The given value for value is not finite
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.Structure.ReinforcementUtils.ComputeOutlineInView(Autodesk.Revit.DB.GeometryObject,Autodesk.Revit.DB.View,Autodesk.Revit.DB.Outline@)
This method computes the Outline of the provided GeometryElement in view.
Returns true if the outline was computed successfully and false otherwise.
geometryObject:
The geometry object to compute outline.
dbView:
The view in which the outline is computed
outline:
The computed outline.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null